let num = Number(prompt("Студенттің курс нөмірін енгізіңіз:  1/2/3/4 "))
let num2 = prompt("Cіз Алматыдан келгенсіз бе?:  yes/no ")


 if (num == 1 || num2 == 2){
  alert("Жатақханадан орын беріледі!")
}
else {
     alert("Жатақана берілмейді!")
}

 


alert("Ойынның шарттары: Дұрыс жауап беілгені әр сұраққа 1 балл беріледі. Сұрақ қойылады жауапты енгізесіз");


let surak1 = prompt("Қазақстан тәуелсіздігін қашан алды?");
let surak2 = prompt("Қазір қай қалада оқып жатырсыз? (Almaty + 1/ Басқасы - 1)");


let score = 0;


if (surak1 == "1991") {
    score += 1;
}

if (surak2.toLowerCase() == "almaty") {
    score += 1;
}


alert("Сіздің жинаған ұпайыңыз: " + score);